/*
 * Copyright (C) 2022 Denis X Alb (DXRW4E)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

//#include "JSONRead.h"
//#include "/storage/emulated/0/JSON/JSONRead.h"

#ifndef _JSONRead_H_
#define _JSONRead_H_

#include <stdlib.h>
#include <wchar.h>
#include <string.h>
#include <errno.h>

#ifdef __cplusplus
extern "C" {
#endif

#ifndef FALSE
	#define FALSE	0
#endif
#ifndef TRUE
	#define TRUE	1
#endif
#ifndef CONST

	typedef long			LONG, * PLONG, * LPLONG;
	typedef int			    INT, * PINT, * LPINT;
	typedef float		    FLOAT, * PFLOAT, * LPFLOAT;
	typedef unsigned short  WORD, * PWORD, * LPWORD;
	typedef int				BOOL, * PBOOL, * LPBOOL;
	typedef unsigned char   BOOLEAN, * PBOOLEAN, * LPBOOLEAN;
	typedef unsigned char   BYTE, * PBYTE, * LPBYTE;
	typedef const           BYTE* PCBYTE, * LPCBYTE;
	typedef void*           LPVOID;
	typedef const void*     LPCVOID;
	typedef size_t		    SIZE_T, * PSIZE_T, * LPSIZE_T;
#ifdef _MSC_VER
	typedef unsigned long	  DWORD, * PDWORD, * LPDWORD;  ////typedef unsigned long   DWORD,  *PDWORD,  *LPDWORD;
	typedef  __int64		  INT64, * PINT64, * LPINT64;
	typedef unsigned __int64  UINT64, * PUINT64, * LPUINT64, QWORD;
#else
	typedef unsigned int	  DWORD, * PDWORD, * LPDWORD;  ////typedef unsigned long   DWORD,  *PDWORD,  *LPDWORD;
	typedef int64_t			  INT64, * PINT64, * LPINT64;
	typedef uint64_t		  UINT64, * PUINT64, * LPUINT64;
#endif
	typedef double			  DOUBLE, * PDOUBLE, * LPDOUBLE;
#endif //_MINWINDEF_

#ifndef StrLen
#define StrLen(s) (wcslen((s)))
#endif
#ifndef IsCharXDigit
#define IsCharXDigit(wch) (iswxdigit(wch))
#endif 

#ifndef _JSON_STRING_COMPARE_FUNCTION
#define _JSON_STRING_COMPARE_FUNCTION
#ifdef _MSC_VER
#define StringEqualN(a, b, n) (!wcsncmp((a), (b), (n)))
#define StringEqualNI(a, b, n) (!_wcsnicmp((a), (b), (n)))
#define StrCmpN(a, b, n) (wcsncmp((a), (b), (n)))
#define StrCmpNI(a, b, n) (_wcsnicmp((a), (b), (n)))
#else
#define StringEqualN(a, b, n) (!wcsncmp((a), (b), (n)))
#define StringEqualNI(a, b, n) (!wcsncasecmp((a), (b), (n)))
#define StrCmpN(a, b, n) (wcsncmp((a), (b), (n)))
#define StrCmpNI(a, b, n) (wcsncasecmp((a), (b), (n)))
#endif
#define StringCompareN   StrCmpN
#define StringCompareNI  StrCmpNI
#endif //_JSON_STRING_COMPARE_FUNCTION

#ifndef ERROR_SUCCESS
	#define ERROR_SUCCESS 0 // NOERROR 0dif
#endif
#ifndef NO_ERROR
	#define NO_ERROR 0 // NOERROR 0
#endif
#ifndef ERROR_NOT_ENOUGH_MEMORY
	#define ERROR_NOT_ENOUGH_MEMORY 8 // ENOMEM 12
#endif 
#ifndef ERROR_INVALID_PARAMETER
	#define ERROR_INVALID_PARAMETER 87 // EINVAL 22
#endif
#ifndef ERROR_INVALID_HANDLE
	#define ERROR_INVALID_HANDLE 6 // EFAULT 14
#endif
#ifndef ERROR_INVALID_DATA
	#define ERROR_INVALID_DATA 13 // EINVAL 22
#endif 
#ifndef ERROR_FILE_NOT_FOUND
	#define ERROR_FILE_NOT_FOUND 2 // ENOFILE 2
#endif 
#ifndef ERROR_INVALID_INDEX
	#define ERROR_INVALID_INDEX 1413  // ENOENT 2
#endif 
#ifndef ERROR_DELETE_PENDING
	#define ERROR_DELETE_PENDING 303  // EBUSY 16 - The file cannot be opened because it is in the process of being deleted.
#endif 
//#ifndef ERROR_NO_MORE_FILES
//	#define ERROR_NO_MORE_FILES 18 // ENMFILE 89
//#endif
#ifndef ERROR_NO_MORE_ITEMS
	#define ERROR_NO_MORE_ITEMS 259 // ENMFILE 89
#endif


//#ifndef _MSC_VER
#define GetLastError() errno
#define SetLastError(dwErrCode)  errno = dwErrCode
//#endif

#ifndef _HANDLE_JSON_
#define _HANDLE_JSON_
	typedef struct _SJSON {
		LPWSTR			lpszKeyName;
		union {
			struct _SJSON* lpMembers;
			LPWSTR		   lpszValue;
		};
		union {
			struct {
				DWORD cchUnEscapeStr;
				DWORD dwNestedLevel;
			};
			DWORD	 dwValue;
			UINT	 uValue;
			int		 iValue;
			float	 fValue;
			INT64	 illValue;
			DOUBLE	 dValue;
			UINT64	 ullValue;
			BOOL	 bValue;
		};
		DWORD cchKeyName;
		DWORD dwMemBuffer;
		union {
			DWORD dwMemCount;	// Count - Data is in name/value pairs ////dwArrayCount; // Count of Array Elements
			DWORD cchValue;
		};
		union {
			union {
				struct {
					WORD IsObject : 1;		  // 0x0001 - Value is Object
					WORD IsArray : 1;		  // 0x0002 - Value is Array
					WORD IsString : 1;		  // 0x0004 - Value is String
					WORD IsBoolean : 1;	      // 0x0008 - Value is Boolean (true or false literals in lower case)
					WORD IsNull : 1;		  // 0x0010 - Value is Null (null literal in lower case)
					WORD IsNumber : 1;		  // 0x0020 - Value is Number
					WORD IsBoolTrue : 1;	  // 0x0040 - Value Boolean is true
					WORD IsSigned : 1;		  // 0x0080 - Number is Signed Integer
					WORD IsFloat : 1;		  // 0x0100 - Number is Float
					WORD IsHexDigit : 1;	  // 0x0200 - Number is HexDigit
					WORD IsNumInit : 1;	      // 0x0400 - StrToNum is Initialized, illValue, ullValue, dValue, fValue contain Number
					WORD IsEscapeStr : 1;	  // 0x0800 - Value String is Escaped = \" or \/ or \\ or \b or \f or \n or \r or \t
					WORD IsSingleQuote : 1;   // 0x1000 - Value String is Single quote 'String'
					WORD IsKeyNameSQ : 1;	  // 0x2000 - KeyName String is Single quote 'String'
					WORD IsDeletePending : 1; // 0x4000 - Is Delete Pending
					WORD IsHandleLock : 1;	  // 0x8000 - Handle is Lock, Edit Pending
					//if ((ullValueullValue & 0xFFFFFFFF00000000) || (ValNum >> 32)) Number is Int64
				};
				struct {
					WORD IsContainer : 2;
					WORD IsStrValue : 4;
				};
				struct { WORD ValueType : 6; };
				struct { WORD ValueTypeEx : 9; };
			};
			WORD wValueType;
		};
		union {
			struct {
				WORD IsHeader : 1;			  // 0x0001 - Handle is Header
				WORD Reserved : 1;			  // 0x0002 - Reserved
				WORD cHandle : 14;			  // 0x0004 - Count Open Handle, MaxSize 0x3FFF - 16383, or 13 bit 0x1FFF - 8191, or 12 bit 0xFFF --> 4095
			};
			WORD wHandleType;
		};
	} SJSON, *PJSON, **PPJSON;
	typedef const SJSON *PCJSON, **PPCJSON;
	typedef PJSON HJSON, *PHJSON;
	typedef PCJSON HCJSON;

	typedef struct _JSON_PARSE {
		PJSON pJSON;
	}JSON_PARSE, *PJSON_PARSE;
#endif // _HANDLE_JSON_

#ifndef _JSON_NUMBER_
#define _JSON_NUMBER_
	typedef union _JSON_NUMBER {
		DWORD  dwValue;
		UINT   uValue;
		int	   iValue;
		float  fValue;
		INT64  illValue;
		DOUBLE dValue;
		UINT64 ullValue;
		BOOL   bValue;
	} JSON_NUMBER, * PJSON_NUMBER;
	////static JSON_NUMBER JSONNum = { 0 };
#endif // _JSON_NUMBER_

#define JSON_IS_OBJECT		  0x00000001  // Value is Object
#define JSON_IS_ARRAY		  0x00000002  // Value is Array
#define JSON_IS_OBJECT_ARRAY  0x00000003  // (JSON_IS_OBJECT | JSON_IS_ARRAY)
#define JSON_IS_CONTAINER	  0x00000003  // (JSON_IS_OBJECT | JSON_IS_ARRAY)
